In [6]:
from connection import MySQLConnection
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

#Data overview

new_connection = MySQLConnection()
 # SQL query of Total Number of Records taken from NYC Data
q1 = (
      '''SELECT count(CAMIS) as `NUMBER OF RESTAURANTS`, 
          `CUISINE DESCRIPTION` FROM DOHMH_New_York_City_Restaurant_Inspection_Results 
GROUP BY `CUISINE DESCRIPTION` ORDER BY `NUMBER OF RESTAURANTS` DESC
limit 999999'''
      )

# Convert the SQL query to Pandas data Frame
r1 = pd.read_sql(q1,  new_connection.con)
r1

    NUMBER OF RESTAURANTS CUISINE DESCRIPTION
0                   55688            American
1                   31397             Chinese
2                   18119               Pizza
3                   14441          Coffee/Tea
4                   12967      Latin American
..                    ...                 ...
83                     18               Czech
84                     10              Basque
85                     10            Lebanese
86                      6          New French
87                      3            Armenian

[88 rows x 2 columns]